{
  "title": "Email Writing Models",
  "samples": [
    {
      "topic": "Informal - Reacting to news and making plans",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Tom, It was absolutely brilliant to get your message yesterday! I literally jumped up and down when I read that you're finally coming to visit! It's been way too long since we last saw each other — I think it was at Sarah's wedding back in June, wasn't it? Time flies!"
        },
        {
          "label": "Main Content",
          "text": "Anyway, I've already started making a list of things we can do! There's this amazing new exhibition at the art museum that I know you'd love — it's all about modern architecture. We could also check out that little Italian restaurant that just opened near the park. Everyone's been raving about their homemade pasta! Oh, and if the weather's nice, we should definitely go for a walk along the river. The autumn colours are absolutely stunning right now."
        },
        {
          "label": "Closing",
          "text": "Let me know your exact dates as soon as you can, so I can book the time off work. I'm so excited about this! Give my love to everyone at home. Can't wait to see you! Lots of love, Sarah"
        }
      ]
    },
    {
      "topic": "Informal - Giving advice to a friend",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Sue, Wow, congratulations! I got your email this morning and I've been grinning like an idiot ever since! That job offer sounds absolutely fantastic — you must be over the moon! I always knew your hard work would pay off eventually."
        },
        {
          "label": "Main Content",
          "text": "Now, about your question — honestly, if I were you, I'd grab this opportunity with both hands! I know the commute's a bit longer, but the salary increase and career prospects make it totally worth it. Plus, working for such a well-known company will look amazing on your CV. That said, you should definitely think carefully about the work-life balance. Maybe you could negotiate working from home a couple of days a week? From my own experience with my job change last year, sometimes taking a risk really does lead to the best opportunities."
        },
        {
          "label": "Closing",
          "text": "Whatever you decide, I'm sure it'll be the right choice for you. Let me know how it goes! We should celebrate either way — fancy meeting for dinner next weekend? Best of luck! Love, Emma"
        }
      ]
    },
    {
      "topic": "Informal - Inviting a friend",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hi Sarah! How are things with you? I feel terrible that we haven't caught up properly in ages — life's been absolutely crazy lately! I keep meaning to call you, but you know how it is. Anyway, I've got some exciting news that I wanted to share!"
        },
        {
          "label": "Main Content",
          "text": "I'm throwing a barbecue party next Saturday (the 15th) and I'd absolutely love you to come! It's going to be quite relaxed — just close friends, good food, and hopefully some sunshine! We're planning to start around 2pm and go on until late. There'll be loads of veggie options too, so don't worry about that. I've also invited a few people from my photography course who I think you'd really get on with. Oh, and feel free to bring someone along if you want! The more the merrier, as they say."
        },
        {
          "label": "Closing",
          "text": "Really hope you can make it — it won't be the same without you! Let me know by Wednesday if possible, just so I know how much food to buy. Looking forward to hearing from you! Lots of love, Jamie"
        }
      ]
    },
    {
      "topic": "Informal - Thanking and updating",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Alex, Thanks so much for your lovely email last week! It was absolutely wonderful to hear from you after such a long time — what's it been, nearly six months? I really appreciated all your kind words and support during that rough patch I was going through. You're such a good friend, honestly."
        },
        {
          "label": "Main Content",
          "text": "Anyway, I'm happy to report that things have been going loads better recently! Remember that marketing job I was telling you about? Well, I got it! I started three weeks ago and I'm absolutely loving it so far. The team's brilliant and the best thing is definitely the flexible working hours — I can actually have a life outside of work now! I've even started taking Spanish lessons on Tuesday evenings, which is something I've wanted to do for years. It's pretty challenging, but I'm really enjoying it. You'd be amazed at how much I've learned already!"
        },
        {
          "label": "Closing",
          "text": "Anyway, enough about me — what's new with you? Drop me a line when you get a chance. Maybe we could meet up for coffee sometime soon? I'd love to catch up properly! Take care of yourself! All my love, Rachel"
        }
      ]
    },
    {
      "topic": "Informal - Apologizing and explaining",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hi Jamie, I'm so, so sorry I haven't been in touch sooner! I feel absolutely terrible about missing your birthday celebration last Saturday — I know how much effort you put into organizing it. I've been feeling guilty all week, to be honest. I hope you're not too angry with me!"
        },
        {
          "label": "Main Content",
          "text": "Let me explain what happened. On Friday evening, my grandmother had a bad fall at home and had to be rushed to hospital. Mum called me in a complete panic, so I drove straight up to Manchester that night. We spent most of Saturday at the hospital while they ran tests. Thankfully, she's going to be okay — just a broken wrist and some nasty bruising. But as you can imagine, it was pretty scary at the time. I'm really sorry I didn't manage to let you know earlier — everything happened so quickly and my phone battery died. I feel awful about letting you down like this."
        },
        {
          "label": "Closing",
          "text": "I'd really love to make it up to you somehow. How about I take you out for dinner next weekend? My treat, obviously! Let me know when you're free. Sorry again for everything! Lots of love, Chris"
        }
      ]
    },
    {
      "topic": "Formal - Job application",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Sir or Madam, I am writing with reference to your advertisement for the position of Marketing Manager. I would like to apply for the role of Digital Marketing Specialist recently advertised in The Guardian. I am interested in applying for the post of Sales Executive."
        },
        {
          "label": "Main Content",
          "text": "During the past few years I have been employed as a Marketing Coordinator at TechCorp. My duties have included managing social media campaigns, which has helped me develop strong analytical skills. I have experience working with international clients and consider myself as a creative problem solver. I believe I would be a suitable candidate because of my proven track record. I am particularly interested in this position as it would allow me to utilize my digital expertise. Furthermore, I am a motivated and reliable person who thrives in challenging environments."
        },
        {
          "label": "Closing",
          "text": "I very much hope you will consider my application. I would be delighted to attend an interview at your convenience. I look forward to hearing from you. Yours faithfully, James Anderson"
        }
      ]
    },
    {
      "topic": "Formal - Requesting information",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Sir or Madam, I am writing to enquire about your English language courses. I would like to request further information regarding the accommodation options available. I saw your advertisement for summer programs and would like to ask several questions."
        },
        {
          "label": "Main Content",
          "text": "Could you please tell me whether courses are available in July? I would also like to know if beginner-level classes are offered. Would it be possible to receive details about the course fees and payment methods? I am planning to stay for three weeks, so I would appreciate information on long-term accommodation. As I will be travelling with my family, I would like to know whether family rooms are available."
        },
        {
          "label": "Closing",
          "text": "I would be grateful if you could reply at your earliest convenience. I look forward to hearing from you soon. Thank you very much for your assistance. Yours faithfully, Maria Santos"
        }
      ]
    },
    {
      "topic": "Formal - Making a complaint",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Sir or Madam, I am writing to complain about the service I received at your restaurant last Saturday. I am writing to express my dissatisfaction with the laptop I purchased from your store. I wish to make a formal complaint regarding my recent hotel stay."
        },
        {
          "label": "Main Content",
          "text": "The main problem was that the food took over two hours to arrive. Furthermore, when it finally came, the meal was cold and poorly prepared. The staff were unhelpful and showed little concern for our complaints. I find this completely unacceptable, especially given the high prices charged. I feel I am entitled to compensation for this disappointing experience. I would appreciate it if you could look into this matter urgently."
        },
        {
          "label": "Closing",
          "text": "I expect to receive a full refund or at minimum a written apology. I look forward to your prompt response to this matter. Unless I hear from you within seven days, I will take further action. Yours faithfully, Robert Williams"
        }
      ]
    },
    {
      "topic": "Formal - Requesting information about a course",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Sir or Madam, I am writing to enquire about the Business Management course advertised on your website. I would like to request information about the Photography diploma program. I saw your advertisement for the Data Science course and I am interested in learning more."
        },
        {
          "label": "Main Content",
          "text": "Could you please provide details about the course duration and start dates? I would be interested to know what qualifications are required for entry. Would it be possible to receive information about scholarship opportunities? I am particularly keen to understand whether practical work experience is included. As I am currently employed full-time, I would appreciate knowing if evening or weekend classes are available."
        },
        {
          "label": "Closing",
          "text": "I would be most grateful if you could send me a prospectus. I look forward to receiving further details at your earliest convenience. Thank you in advance for your help. Yours sincerely, David Chen"
        }
      ]
    },
    {
      "topic": "Formal - Applying for a volunteer position",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Selection Committee, I am writing to apply for the volunteer teaching position in Nepal. I wish to express my interest in the environmental conservation project. I would like to be considered for the community outreach volunteer role."
        },
        {
          "label": "Main Content",
          "text": "I have always been passionate about education and helping disadvantaged communities. Over the past three years, I have volunteered at local schools teaching English to refugees. This experience has taught me patience, adaptability, and cross-cultural communication skills. I believe I possess the qualities necessary for this demanding role. I am particularly drawn to this opportunity because it combines my teaching skills with my interest in international development. Moreover, I am a dedicated and enthusiastic individual who works well in teams."
        },
        {
          "label": "Closing",
          "text": "I would welcome the opportunity to discuss my application in more detail. I am available for an interview at any time that suits you. Thank you for considering my application. Yours sincerely, Laura Martinez"
        }
      ]
    },
    {
      "topic": "Informal - Suggesting plans",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hey Chris! Great chatting with you on the phone yesterday — it really made my day! I've been thinking about your visit next month and I'm getting so excited about it! I've come up with some ideas for things we could do, so let me know what you think."
        },
        {
          "label": "Main Content",
          "text": "How about we kick things off with the Modern Art Museum on Saturday morning? I've heard their new interactive exhibition is absolutely mind-blowing. The best time to go is probably around 10am, before it gets too crowded with tourists. After that, we could grab lunch at that new Thai place everyone's been talking about — apparently their green curry is to die for! In the evening, there's a live music night at the Jazz Cafe if you're interested? As for accommodation, I can definitely help you find somewhere to stay. There's a lovely B&B just around the corner from my flat, or you're more than welcome to crash on my sofa if you don't mind roughing it a bit!"
        },
        {
          "label": "Closing",
          "text": "Let me know what dates work best for you and I'll book everything. This is going to be such brilliant fun! Can't wait to show you around! Stay in touch! Your mate, Alex"
        }
      ]
    },
    {
      "topic": "Informal - Responding to good news",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Emma, Oh my goodness! I literally screamed when I opened your email this morning — my flatmate thought something terrible had happened! Congratulations on your engagement! This is the most amazing news ever! I'm absolutely thrilled for both of you. Mark's such a lovely guy and you two are just perfect together."
        },
        {
          "label": "Main Content",
          "text": "I can't believe it's finally happening! You've been together for what, five years now? It's about time he popped the question! So come on, tell me everything — where did he propose? Was it romantic? Did he go down on one knee? I'm dying to hear all the details! You absolutely deserve all the happiness in the world, honestly. Now, about the wedding — I know it's early days, but if you need any help with planning, I'm totally here for you! I'd love to come dress shopping with you if you want some company. And just so you know, I'm completely free most weekends for the next few months!"
        },
        {
          "label": "Closing",
          "text": "Congratulations again to both of you! I can't wait to celebrate properly! Give Mark a big hug from me. We need to meet up soon so you can show me the ring! Much love, Sophie xxx"
        }
      ]
    },
    {
      "topic": "Informal - Asking for advice",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hi Lucy, I hope you're doing well! Listen, I really need to pick your brain about something important and you're the first person I thought of. You always give such sensible advice, and right now I'm feeling completely stuck and could really use your wisdom!"
        },
        {
          "label": "Main Content",
          "text": "So here's the situation — I've been offered two different jobs and I honestly have no idea which one to choose! Job A is with a big marketing firm in London. The salary's fantastic (nearly £10k more than I'm earning now!) but it would mean commuting for two hours each day and probably working quite long hours. Job B is much closer to home, the work-life balance seems brilliant, and the team seemed really friendly when I met them. But the pay's not quite as good and it's a smaller company. What do you think I should consider? If you were in my shoes, which would you go for? I keep changing my mind every five minutes! Maybe we could meet for coffee this week and talk it through properly?"
        },
        {
          "label": "Closing",
          "text": "I'd really value your opinion on this! Let me know when you're free for that chat. Thanks so much in advance — you're an absolute star! Your confused friend, Dan xxx"
        }
      ]
    },
    {
      "topic": "Formal - Requesting a reference",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Professor Anderson, I hope this email finds you well. I am writing to ask if you would be willing to provide a reference for me. I would be extremely grateful if you could write a letter of recommendation on my behalf."
        },
        {
          "label": "Main Content",
          "text": "I am applying for the Master's program in Environmental Science at Oxford University. As you supervised my undergraduate dissertation on climate change, I believe you are well-positioned to comment on my academic abilities. The application deadline is March 15th, so I would need the reference by March 10th at the latest. I have attached my CV and a draft of my personal statement for your information. If you require any additional materials, please do not hesitate to let me know."
        },
        {
          "label": "Closing",
          "text": "I would be deeply grateful for your support with this application. Thank you very much for considering my request. I look forward to hearing from you. Yours sincerely, Thomas Mitchell"
        }
      ]
    },
    {
      "topic": "Formal - Booking accommodation",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Reservations Manager, I am writing to enquire about availability at your hotel for August. I would like to make a reservation for three nights from July 15th to July 18th. I am interested in booking a family room for four people."
        },
        {
          "label": "Main Content",
          "text": "Could you please confirm whether you have rooms available for these dates? I would also like to know if breakfast is included in the room rate. Would it be possible to arrange airport transportation? We will be arriving late in the evening, so I would appreciate knowing the check-in procedure. Additionally, could you inform me about any facilities available for children? As we have specific dietary requirements, I would like to enquire about the restaurant menu options."
        },
        {
          "label": "Closing",
          "text": "I would be grateful if you could send me a quotation for this stay. I look forward to your reply at your earliest convenience. Thank you for your assistance with this matter. Yours faithfully, Jennifer Brown"
        }
      ]
    },
    {
      "topic": "Informal - Sharing travel experiences",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hey Rachel! I'm back from Japan and oh my god, where do I even begin? I landed yesterday afternoon and I'm still jet-lagged, but I just had to email you straight away because the trip was absolutely incredible! Honestly, it was even better than I'd imagined, and you know how high my expectations were!"
        },
        {
          "label": "Main Content",
          "text": "Tokyo was absolutely mind-blowing — all those neon lights, the crazy busy streets, the vending machines on every corner selling everything you can imagine! The food was out of this world. I'm not even joking when I say I tried sushi at about twenty different places, and every single one was amazing. Then we went to Kyoto, which was like stepping into a completely different world. The temples were so peaceful and beautiful — I must have taken about a thousand photos! The Japanese people were incredibly friendly and helpful too, even though my attempts at speaking Japanese were pretty embarrassing. You'd absolutely love it there, I'm sure. We should seriously think about planning a trip together sometime!"
        },
        {
          "label": "Closing",
          "text": "Anyway, I've bought you some souvenirs that I think you'll love! Let's meet up for coffee soon so I can give them to you and bore you with all my holiday photos! Missing you loads! Big hugs, Mike xxx"
        }
      ]
    },
    {
      "topic": "Formal - Responding to a job offer",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Ms. Thompson, Thank you very much for your email offering me the position of Senior Analyst. I am writing to formally accept this offer with great enthusiasm. I am delighted to confirm my acceptance of the role."
        },
        {
          "label": "Main Content",
          "text": "As discussed, I understand that my starting salary will be £45,000 per annum with performance-based bonuses. I confirm that I am able to commence employment on April 1st as proposed. I note that you mentioned the need for certain documentation, and I will ensure all required paperwork is submitted before my start date. Could you please confirm the arrangements for my first day, including the reporting time and location?"
        },
        {
          "label": "Closing",
          "text": "I am very much looking forward to joining your team and contributing to the company's success. Thank you once again for this wonderful opportunity. Please do not hesitate to contact me if you need any further information. Yours sincerely, Sarah Johnson"
        }
      ]
    },
    {
      "topic": "Informal - Declining an invitation",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hi Mike, Thanks so much for the invitation to your party on Saturday! It sounds like it's going to be absolutely brilliant and I'm genuinely gutted that I can't make it. I was really looking forward to it when I first heard you were organizing something!"
        },
        {
          "label": "Main Content",
          "text": "The problem is, I've already promised my grandparents that I'd visit them this weekend, and I really can't let them down. They're getting on a bit now and I don't see them nearly as often as I should. My gran's been asking when I'm coming up for ages, so I feel terrible even thinking about cancelling on them. I know your parties are always legendary, so I'm really disappointed to be missing out! Is there any chance we could meet up for drinks the following weekend instead? I'd love to catch up properly and hear all about how the party went. Plus, I owe you a birthday pint from last month anyway!"
        },
        {
          "label": "Closing",
          "text": "Hope you have the most amazing time and that the weather holds out for you! Send me some photos! Sorry again for not being there. Lots of love, Ben xx"
        }
      ]
    },
    {
      "topic": "Formal - Confirming attendance",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Dear Conference Organizers, I am writing to confirm my attendance at the International Marketing Conference. Thank you for accepting my registration for the event on November 12th. I am pleased to confirm that I will be attending the symposium as planned."
        },
        {
          "label": "Main Content",
          "text": "I would like to confirm that I will be presenting during the afternoon session as scheduled. Could you please provide information about the presentation equipment that will be available? I will require a laptop connection and a microphone for my 30-minute presentation. Additionally, I would be grateful if you could send me details about the hotel accommodation arrangements. Would it be possible to receive a map of the venue in advance?"
        },
        {
          "label": "Closing",
          "text": "I look forward to participating in this prestigious event. Thank you for organizing what promises to be an excellent conference. Please contact me if you require any additional information. Yours sincerely, Dr. Michael Foster"
        }
      ]
    },
    {
      "topic": "Informal - Making arrangements",
      "paragraphs": [
        {
          "label": "Opening",
          "text": "Hi Sophie! Following up on our chat yesterday about the weekend getaway — I've been doing some research online and I think I've found the absolutely perfect place! You're going to love this idea, honestly!"
        },
        {
          "label": "Main Content",
          "text": "So, there's this gorgeous little cottage by Lake Windermere that's available from Friday to Sunday. It sleeps six people really comfortably and it's got a wood-burning fireplace, which will be perfect for cozy evenings. The photos look amazing! The cost is £300 for the whole weekend, which works out at just £50 each if we can get six people together. I've already mentioned it to Emma and Jack, and they're both definitely up for it. The plan would be to leave on Friday afternoon around 4pm to miss the rush hour traffic. We could stop somewhere nice for dinner on the way up. I need to book it pretty soon though, because places like this get snapped up quickly. Can everyone get their share to me by Wednesday?"
        },
        {
          "label": "Closing",
          "text": "This is going to be so much fun! Get back to me as soon as you can about the dates and let me know if you're definitely in. Can't wait to spend some proper quality time with everyone! Chat soon, Hannah xxx"
        }
      ]
    }
  ]
}
