{
  "metadata": {
    "purpose": "Thesis statements for B2 essays",
    "audience": "B2 students",
    "description": "Clear thesis statements that preview essay structure",
    "version": "1.0"
  },
  "structures": {
    "for_and_against": {
      "title": "For & Against Essays - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (Last line of introduction)",
          "purpose": "State you will consider both sides",
          "phrases": {
            "default": [
              "This essay will discuss the main advantages and disadvantages of [topic].",
              "In the following paragraphs, I will consider both the benefits and drawbacks of [topic].",
              "I will examine arguments for and against [topic] before reaching a conclusion.",
              "To form a balanced view, it is helpful to explore both sides of [topic].",
              "The aim of this essay is to weigh up the pros and cons of [topic]."
            ],
            "alt1": [
              "This essay will evaluate both sides of the [topic] debate.",
              "I will look at the positive and negative aspects of [topic] in turn.",
              "The discussion below will consider the main arguments for and against [topic].",
              "By examining both perspectives, we can reach a more informed conclusion.",
              "This essay aims to present a balanced analysis of [topic]."
            ],
            "alt2": [
              "This essay will assess whether the advantages of [topic] outweigh its disadvantages.",
              "I will explore competing viewpoints on [topic] before stating my position.",
              "The following paragraphs will examine both the strengths and weaknesses of [topic].",
              "A careful evaluation of evidence on both sides is necessary.",
              "Ultimately, this essay seeks to determine whether [topic] is beneficial overall."
            ]
          }
        }
      }
    },
    "problems_and_solutions": {
      "title": "Problems & Solutions - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (What the essay will do)",
          "purpose": "Say you will discuss problems and solutions",
          "phrases": {
            "default": [
              "This essay will outline the main problems caused by [topic] and suggest possible solutions.",
              "In the following paragraphs, I will explain the key difficulties and propose ways to address them.",
              "I will identify the main issues related to [topic] and discuss how they can be solved.",
              "This essay will examine why [problem] occurs and what can be done about it.",
              "The aim is to highlight the causes of [problem] and present realistic solutions."
            ],
            "alt1": [
              "This essay will explore the challenges posed by [problem] and evaluate potential remedies.",
              "I will look at the main problems associated with [topic] and recommend practical measures.",
              "The discussion below will analyze both the difficulties and the ways to overcome them.",
              "This essay aims to identify workable solutions to [problem].",
              "By understanding the root causes, we can develop effective strategies to tackle [problem]."
            ],
            "alt2": [
              "This essay will consider what makes [problem] so serious and how it might be resolved.",
              "I will examine the key factors behind [problem] and suggest ways forward.",
              "The following paragraphs will address both the nature of [problem] and possible responses.",
              "A clear understanding of [problem] is essential before solutions can be proposed.",
              "This essay will present a comprehensive approach to dealing with [problem]."
            ]
          }
        }
      }
    },
    "cause_and_effect": {
      "title": "Cause & Effect - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (What you will analyse)",
          "purpose": "State you will explain causes and effects",
          "phrases": {
            "default": [
              "This essay will explain the main causes of [phenomenon] and describe its effects.",
              "In the following paragraphs, I will look at why [phenomenon] happens and what it leads to.",
              "To understand [phenomenon], it is useful to consider both its reasons and its consequences.",
              "This essay will explore the factors behind [phenomenon] and the results it produces.",
              "The aim is to identify the key causes and examine their impact."
            ],
            "alt1": [
              "This essay will analyze both the origins of [phenomenon] and its consequences.",
              "I will examine what drives [phenomenon] and how it affects [area/group].",
              "The discussion below will explore the relationship between causes and effects.",
              "By considering both why [phenomenon] occurs and what results from it, we can gain deeper insight.",
              "This essay aims to trace the causal chain from origins to outcomes."
            ],
            "alt2": [
              "This essay will investigate the root causes of [phenomenon] and its wide-ranging effects.",
              "I will explore the factors that have led to [phenomenon] and assess its impact.",
              "Understanding [phenomenon] requires examining both what produces it and what it produces.",
              "The following paragraphs will establish clear links between causes and consequences.",
              "A cause-and-effect analysis will reveal how [phenomenon] emerged and why it matters."
            ]
          }
        }
      }
    },
    "agree_and_disagree": {
      "title": "Agree & Disagree - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (Plan + your position)",
          "purpose": "Say you will consider both sides and give your opinion",
          "phrases": {
            "default": [
              "This essay will discuss both sides before giving my opinion.",
              "In the following paragraphs, I will consider arguments for and against this view and then state my position.",
              "I will examine both perspectives and explain which one I find more convincing.",
              "This essay will look at the main reasons people agree and disagree with [statement].",
              "After considering both viewpoints, I will explain my own opinion."
            ],
            "alt1": [
              "This essay will evaluate both sides of the debate before reaching a conclusion.",
              "I will explore the merits of each position and then justify my own view.",
              "The discussion below will weigh the arguments on both sides.",
              "Having examined competing perspectives, I will explain where I stand.",
              "This essay aims to present a fair hearing for both sides before offering my judgment."
            ],
            "alt2": [
              "This essay will analyze the key arguments for and against [statement] before taking a position.",
              "I will assess the strength of each side's case and then defend my own conclusion.",
              "A balanced evaluation of both perspectives is necessary before forming an opinion.",
              "By considering the evidence on all sides, I will arrive at a well-founded position.",
              "This essay seeks to move beyond polarization by carefully examining each viewpoint."
            ]
          }
        }
      }
    },
    "opinion": {
      "title": "Opinion Essay - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (Your opinion clearly)",
          "purpose": "State your position directly and confidently",
          "phrases": {
            "default": [
              "In my view, [opinion].",
              "Personally, I believe that [opinion].",
              "I think [opinion], for several reasons.",
              "From my perspective, [opinion].",
              "I firmly believe that [opinion]."
            ],
            "alt1": [
              "I am convinced that [opinion].",
              "My position is that [opinion].",
              "I would argue that [opinion].",
              "In my judgment, [opinion].",
              "I strongly support the view that [opinion]."
            ],
            "alt2": [
              "My considered opinion is that [opinion].",
              "I hold the view that [opinion].",
              "Having thought carefully about this, I believe [opinion].",
              "It is my firm conviction that [opinion].",
              "I am of the opinion that [opinion]."
            ]
          }
        }
      }
    },
    "speculation_and_trends": {
      "title": "Trends & Predictions - Thesis Statements",
      "sections": {
        "thesis_statement": {
          "label": "Thesis (What you will cover)",
          "purpose": "State you will discuss causes and predict future",
          "phrases": {
            "default": [
              "This essay will explain why this trend is happening and what it could lead to in the future.",
              "In the following paragraphs, I will discuss the causes of this trend and make predictions about what may happen next.",
              "To understand this trend, it is useful to look at its reasons and its likely future effects.",
              "This essay will consider why [trend] is growing and how it may develop.",
              "The aim is to identify the key drivers of [trend] and predict its impact."
            ],
            "alt1": [
              "This essay will analyze the factors behind [trend] and project its future trajectory.",
              "I will examine what is fueling [trend] and forecast its likely evolution.",
              "The discussion below will explore both the origins and the probable outcomes of [trend].",
              "By understanding the present, we can anticipate the future of [trend].",
              "This essay seeks to explain [trend] and speculate on where it is heading."
            ],
            "alt2": [
              "This essay will investigate the driving forces behind [trend] and extrapolate future developments.",
              "I will trace the roots of [trend] and project its implications going forward.",
              "The analysis will connect current causes with anticipated effects.",
              "Understanding why [trend] is occurring enables informed predictions about its future.",
              "This essay will map the trajectory of [trend] from present causes to future consequences."
            ]
          }
        }
      }
    }
  }
}
